import React from 'react';
import BreadCrumbs from '../../common/BreadCrumbs';
import CustomLink from '../../common/CustomLink';

const items = [
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: '300 тем для статей в блог по маркетингу',
    desc: 'В прошлый раз мы подготовили статью, где составили список из 205 универсальных тем для любого блога. На этот раз сабж более конкретный — маркетинг. Мы осмотрели на свои нычки и черновики и поняли, что накопили очень много тем для статей в блог по маркетингу.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: '300 тем для статей в блог по маркетингу',
    desc: 'В прошлый раз мы подготовили статью, где составили список из 205 универсальных тем для любого блога. На этот раз сабж более конкретный — маркетинг. Мы осмотрели на свои нычки и черновики и поняли, что накопили очень много тем для статей в блог по маркетингу.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: 'Как заказать текст для сайта: 33 совета заказчику, которому дороги нервы',
    desc: 'Эттеншн, периодически 18+. Купить текст = купить любой другой товар.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: '300 тем для статей в блог по маркетингу',
    desc: 'В прошлый раз мы подготовили статью, где составили список из 205 универсальных тем для любого блога. На этот раз сабж более конкретный — маркетинг. Мы осмотрели на свои нычки и черновики и поняли, что накопили очень много тем для статей в блог по маркетингу.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: 'Как заказать текст для сайта: 33 совета заказчику, которому дороги нервы',
    desc: 'Эттеншн, периодически 18+. Купить текст = купить любой другой товар.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: 'Как заказать текст для сайта: 33 совета заказчику, которому дороги нервы',
    desc: 'Эттеншн, периодически 18+. Купить текст = купить любой другой товар.',
    date: '20.09.2018',
  },
  {
    imgSrc: '/images/content/blog/blog1.jpg',
    title: '300 тем для статей в блог по маркетингу',
    desc: 'В прошлый раз мы подготовили статью, где составили список из 205 универсальных тем для любого блога. На этот раз сабж более конкретный — маркетинг. Мы осмотрели на свои нычки и черновики и поняли, что накопили очень много тем для статей в блог по маркетингу.',
    date: '20.09.2018',
  },
];

const listItemsRender = (items) => {
  return (
    items.map((item, index) => {
      return (
        <li className="blog-section__item">
          <img src={item.imgSrc} alt="" className="blog-section__item-img"/>
          <div className="blog-section__item-title">{item.title}</div>
          <div className="blog-section__item-desc">{item.desc}</div>
          <div className="blog-section__item-date">{item.date}</div>
        </li>
      );
    })
  );
};

const BlogSection = (props) => {
  return (
    <div className="blog-section">
      <div className="blog-section__subtitle">Делимся опытом</div>
      <h2 className="blog-section__title">Блог</h2>
      <BreadCrumbs />
      <div className="blog-section__wrapper-list">
        <ul className="blog-section__list">
          { listItemsRender(items) }
        </ul>
      </div>
      <div className="blog-section__link">
        <CustomLink text='Больше' href='#' />
      </div>
       <svg className='blog-section__svg' width="1399px" height="395px" viewBox="0 0 1399 395" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
        <title>E6783E05-4B47-43D3-A3E2-02F9BAC27223</title>
        <desc>Created with sketchtool.</desc>
        <defs />
        <g id="Page-1" stroke="none" strokeWidth={1} fill="none" fillRule="evenodd">
          <g id="блог" transform="translate(-1.000000, -2100.000000)" stroke="#3C3C3C" strokeWidth={2}>
            <path d="M275.267956,2287.36665 C290.973011,2308.30673 300.919546,2335.00532 300.396044,2361.18041 C299.872542,2387.3555 290.973011,2414.0541 275.267956,2434.99417 C260.086403,2456.45774 237.575824,2472.1628 212.447736,2480.01533 C200.407194,2483.67984 187.319648,2485.77385 174.232103,2485.77385 L2,2485.77385 L2,2108.85253 L256.42189,2108.85253 L256.42189,2180.04878 L73.1962491,2180.04878 L73.1962491,2237.11048 L174.232103,2237.11048 C215.588747,2237.11048 253.280879,2257.00355 275.267956,2287.36665 Z M228.152791,2361.18041 C228.676293,2348.61637 223.964777,2336.57582 216.635751,2326.62929 C205.642212,2311.97124 187.84315,2303.59521 173.708601,2303.59521 L73.1962491,2303.59521 L73.1962491,2418.76561 L173.708601,2418.76561 C188.366652,2418.76561 204.595209,2409.86608 214.541744,2398.34904 C223.441275,2388.40251 227.629289,2374.79146 228.152791,2361.18041 Z M661.611074,2108.85253 L661.611074,2485.77385 L590.414825,2485.77385 L590.414825,2175.86076 L463.20388,2175.86076 L438.075792,2386.3085 C429.176261,2461.69276 392.007631,2495.72038 321.334884,2485.77385 L321.334884,2422.95363 C355.362503,2421.90662 370.020554,2402.53706 373.685067,2371.12695 L405.618679,2108.85253 L661.611074,2108.85253 Z M907.132053,2493.62637 C853.211364,2493.62637 800.861181,2472.6863 768.404067,2431.85316 C738.040961,2395.20803 724.429913,2347.56936 724.429913,2297.31319 C724.429913,2247.05701 738.040961,2198.89484 768.404067,2162.24971 C801.384683,2120.89307 852.687862,2101 907.132053,2101 C961.576243,2101 1012.35592,2121.41657 1045.86004,2162.24971 C1077.79365,2200.98885 1088.78719,2247.05701 1089.83419,2297.31319 C1088.78719,2349.66337 1076.74665,2394.16103 1045.86004,2431.85316 C1011.30892,2473.7333 959.482236,2493.62637 907.132053,2493.62637 Z M907.132053,2426.61814 C939.589166,2427.14164 970.475774,2414.0541 989.32184,2388.92601 C1008.16791,2363.79792 1014.44993,2330.2938 1014.44993,2297.31319 C1014.44993,2264.33257 1008.16791,2230.30495 989.32184,2205.70037 C970.475774,2180.57228 939.589166,2167.48473 907.132053,2168.00823 C874.674939,2167.48473 843.264829,2180.57228 824.942265,2205.70037 C805.572697,2230.30495 799.814177,2264.33257 799.290675,2297.31319 C799.814177,2330.2938 805.572697,2363.79792 824.942265,2388.92601 C843.264829,2414.0541 874.674939,2427.14164 907.132053,2426.61814 Z M1398.69884,2108.85253 L1398.69884,2180.04878 L1223.84923,2180.04878 L1223.84923,2485.77385 L1152.65298,2485.77385 L1152.65298,2108.85253 L1398.69884,2108.85253 Z" id="Блог" />
          </g>
        </g>
      </svg>
    </div>
  );
};

export default BlogSection;
