import React from 'react';

const CaseBody = (props) => {
  return (
    <div className="case__body">
      <div className="case__main-img">
        <div className="case__img-wrap">
          <img src="/images/content/case/portfolio.jpg" alt="" className="case__img"/>
        </div>
        <div className="case__main-title">
          Контент-маркетинг для Академии Лидогенерации
        </div>
      </div>
      <div className="case__links">
        <a href="" className="case__link">Сайт Академии Лидогенерации</a>
        <a href="" className="case__link">Сообщество во ВКонтакте</a>
      </div>
      <div className="case__desk">
        Ведем блог Академии Лидогенерации с начала 2017 года. За это время выпустили больше 60 статей, повысили SEO-трафик на сайт в 3 раза. С июля 2018 ведем соцсети: ВКонтакте, Фейсбук, Инстаграм и Телеграм. В первую же неделю работы получили Огонь Прометея во Вконтакте и через месяц — еще один. За 2 месяца повысили органический охват постов в 7 раз, вовлеченность в 4 раза, количество переходов из соцсетей на сайт — в 3 раза. Продолжаем работать с Академией и дальше.
      </div>
      <div className="case__client-tasks">
        <div className="case__client">
          <div className="case__client-title">О клиенте</div>
          <div className="case__client-desc">
          Академия Лидогенерации — крупная онлайн-школа интернет-маркетинга. В ней учат привлекать клиентов в бизнес с помощью таргетированной рекламы, рассылок, соцсетей, контент-маркетинга и других инструментов. В блоге и соцсетях Академия пишет полезные советы по лидогенерации и маркетингу. Статьи для блога Академии мы начали писать еще до того, как открыли агентство.
          </div>
          <div className="case__client-logo">
            <img src="" alt="" className="case__client-img"/>
          </div>
        </div>
        <div className="case__tasks">
        <div className="case__tasks-title">О клиенте</div>
          <ul className="case__tasks-list">
            <li className="case__tasks-item">
              1. Регулярно выпускать полезные статьи для блога, которые покажут экспертность Академии и увеличат поток органического трафика на сайт
            </li>
            <li className="case__tasks-item">
              2. Вести соцсети Академии, повышать вовлеченность аудитории, увеличить количество переходов из соцсетей на сайт
            </li>
            <li className="case__tasks-item">
              3. Составить редполитику, чтобы все авторы писали в похожем стиле
            </li>
            <li className="case__tasks-item">
              4. Подхватывать срочные задачи — например, сделать рассылку или текст для нового лендинга
            </li>
          </ul>
        </div>
      </div>
      <div className="case__project">
        <div className="case__project-title">Что мы сделали</div>
        <div className="case__project-subtitle">Написали несколько тестовых статей</div>
        <div className="case__project-desc">Перед тем, как продумывать контент-план на месяцы вперед, необходимо понять, что интересно аудитории, какая подача ей ближе. Поэтому первые статьи мы писали без плана: придумали тему → согласовали с клиентом → опубликовали → посмотрели на результат. Наши посты сразу понравились аудитории. В среднем они собирали 5000-15 000 просмотров и 100-200 репостов против 2000-3000 просмотров и 20-30 репостов у старых материалов. Сейчас у них уже по 8-30 тысяч просмотров за счет SEO-трафика. Так за месяц мы выработали подачу контента, которая устраивала Академию и нравилась ее аудитории.</div>
        <div className="case__project-img-wrap">
          <img src="/images/content/case/portfolio.jpg" alt="" className="case__project-img"/>
          <div className="case__project-img-name">Одни из первых статей для Академии</div>
        </div>
        <div className="case__project-articles">
          <div className="case__project-articles-subtitle">Написали несколько тестовых статей</div>
          <div className="case__project-articles-text">
            <div className="case__project-articles-left">Перед тем, как продумывать контент-план на месяцы вперед, необходимо понять, что интересно аудитории, какая подача ей ближе. Поэтому первые статьи мы писали без плана: придумали тему → согласовали с клиентом → опубликовали → посмотрели на результат. Наши посты сразу понравились аудитории. В среднем они собирали 5000-15 000 просмотров и 100-200 репостов против 2000-3000 просмотров и 20-30 репостов у старых материалов.</div>
            <div className="case__project-articles-right"> Сейчас у них уже по 8-30 тысяч просмотров за счет SEO-трафика. Так за месяц мы выработали подачу контента, которая устраивала Академию и нравилась ее аудитории. Наши посты сразу понравились аудитории. В среднем они собирали 5000-15 000 просмотров и 100-200 репостов против 2000-3000 просмотров и 20-30 репостов у старых материалов.</div>
          </div>
        </div>
        <div className="case__project-img-wrap case__project-img-wrap--last">
          <img src="/images/content/case/portfolio.jpg" alt="" className="case__project-img"/>
          <div className="case__project-img-name">Одни из первых статей для Академии</div>
        </div>
        <div className="case__project-first-block">Обзор продукта от независимого эксперта — с плюсами и минусами. Обзор продукта от лидера мнений — блогера с большим числом подписчиков. Контроль качества — кто и как следит за тем, чтобы продукт/услуга получались лучшими или близкими к этой характеристике.</div>
        <div className="case__project-second-block">
          <div className="case__project-text">Обзор продукта от независимого эксперта — с плюсами и минусами. Обзор продукта от лидера мнений — блогера с большим числом подписчиков. Контроль качества — кто и как следит за тем, чтобы продукт/услуга получались лучшими или близкими к этой характеристике.</div>
          <button className="case__project-text-btn">Отправить</button>
        </div>
        <div className="case__user">
          <div className="case__user-left">
            <div className="case__user-img-wrap">
              <img src="/images/content/case/avatar2.png" alt="" className="case__user-img"/>
            </div>
            <div className="case__user-img-name">Екатерина, Должность <span>Источник</span></div>
          </div>
          <div className="case__user-right">Обзор продукта от независимого эксперта — с плюсами и минусами. Обзор продукта от лидера мнений — блогера с большим числом подписчиков. Обзор продукта от независимого эксперта — с плюсами и минусами. Обзор продукта от лидера мнений — блогера с большим числом подписчиков.</div>
        </div>
        <div className="case__footer">
          <div className="case__footer-title">h4: Указывайте в первом сообщении как можно больше информации</div>
          <div className="case__footer-desc">Обзор продукта от независимого эксперта — с плюсами и минусами. Обзор продукта от лидера мнений — блогера с большим числом подписчиков. Контроль качества — кто и как следит за тем, чтобы продукт/услуга получались лучшими или близкими к этой характеристике.</div>
        </div>
      </div>
    </div>
  );
};

export default CaseBody;
